"use strict";

// 1 завдання
const x = 16;
const y = 4;

console.log("Результат додавання: ", x + y);
console.log("Результат віднімання: ", x - y);
console.log("Результат множення : ", x * y);
console.log("Результат ділення : ", x / y);
console.log("Результат зведення в ступінь : ", x ** y);
console.log("Результат знаходження квадратного кореню : ", Math.sqrt(x));


// 2 завдання

const z = 25;
const f = "35";

console.log("Результат перетворення на рядок: ", z + '');
console.log("Результат перетворення на число: ", +f);
console.log("Результат перетворення на булеве значення: ", !!z);